# Kuntadatan tutkimista

In [27]:
import pandas as pd

In [28]:
# ladataan data, jätetään pois ensimmäinen rivi, joka ei kuulu taulukkoon

df = pd.read_csv('Kuntien_avainluvut_2020_1.csv', sep=';', skiprows=1, encoding='iso8859_15')
df.head()

   Alue 2019    Tiedot   2018
0       Akaa  Väkiluku  16611
1   Alajärvi  Väkiluku   9700
2  Alavieska  Väkiluku   2573
3     Alavus  Väkiluku  11544
4   Asikkala  Väkiluku   8149

In [29]:
df.tail(10)

                    Alue 2019    Tiedot   2018
390       Kajaanin seutukunta  Väkiluku  51986
391     Rovaniemen seutukunta  Väkiluku  66818
392   Kemi-Tornion seutukunta  Väkiluku  57150
393  Torniolaakson seutukunta  Väkiluku   7460
394      Itä-Lapin seutukunta  Väkiluku  16067
395  Tunturi-Lapin seutukunta  Väkiluku  14421
396  Pohjois-Lapin seutukunta  Väkiluku  16606
397           Mariehamns stad  Väkiluku  11743
398          Ålands landsbygd  Väkiluku  15973
399           Ålands skärgård  Väkiluku   2073

In [30]:
# katsotaan datan koko
df.shape

(400, 3)

In [31]:
# väkilukusarakkeen tietoja

df['2018'].describe()

count    4.000000e+02
mean     4.138439e+04
std      1.330630e+05
min      9.100000e+01
25%      3.333500e+03
50%      8.545500e+03
75%      2.469100e+04
max      1.671024e+06
Name: 2018, dtype: float64

In [32]:
df['2018'].mean()

41384.3925

In [33]:
# alle 1000 asukkaan kunnat

df[df['2018'] < 1000]

         Alue 2019    Tiedot  2018
7           Brändö  Väkiluku   449
8           Eckerö  Väkiluku   961
17           Föglö  Väkiluku   534
18            Geta  Väkiluku   514
21        Hailuoto  Väkiluku   974
113       Kumlinge  Väkiluku   315
117        Kustavi  Väkiluku   926
122          Kökar  Väkiluku   236
136     Lestijärvi  Väkiluku   737
145        Luhanka  Väkiluku   707
147     Lumparland  Väkiluku   382
189  Pelkosenniemi  Väkiluku   954
257       Sottunga  Väkiluku    91
303          Vårdö  Väkiluku   448

In [34]:
# yli 150000 asukkaan kunnat

df[df['2018'] > 150000]

                       Alue 2019    Tiedot     2018
11                         Espoo  Väkiluku   283632
33                      Helsinki  Väkiluku   648042
180                         Oulu  Väkiluku   203567
268                      Tampere  Väkiluku   235239
276                        Turku  Väkiluku   191331
291                       Vantaa  Väkiluku   228166
311           Uudenmaan maakunta  Väkiluku  1671024
312    Varsinais-Suomen maakunta  Väkiluku   478582
313          Satakunnan maakunta  Väkiluku   218624
314        Kanta-Hämeen maakunta  Väkiluku   171364
315          Pirkanmaan maakunta  Väkiluku   515095
316       Päijät-Hämeen maakunta  Väkiluku   200629
317        Kymenlaakson maakunta  Väkiluku   173388
320       Pohjois-Savon maakunta  Väkiluku   245602
321    Pohjois-Karjalan maakunta  Väkiluku   162240
322        Keski-Suomen maakunta  Väkiluku   275521
323    Etelä-Pohjanmaan maakunta  Väkiluku   189715
324          Pohjanmaan maakunta  Väkiluku   180794
326  Pohjois-Pohjanmaan maakunta  Väkiluku   412161
328               Lapin maakunta  Väkiluku   178522
330         Helsingin seutukunta  Väkiluku  1553053
336             Turun seutukunta  Väkiluku   330173
347         Tampereen seutukunta  Väkiluku   406622
350            Lahden seutukunta  Väkiluku   200629
366        Jyväskylän seutukunta  Väkiluku   185430
382             Oulun seutukunta  Väkiluku   250415

In [35]:
# datassa olikin sekä kuntia että maakuntia yms., joten erotetaan kunnat omaksi dataframeksi
# vaihdetaan ensin indeksiksi paikannimi

df.set_index('Alue 2019', inplace=True)

df.head()

             Tiedot   2018
Alue 2019
Akaa       Väkiluku  16611
Alajärvi   Väkiluku   9700
Alavieska  Väkiluku   2573
Alavus     Väkiluku  11544
Asikkala   Väkiluku   8149

In [36]:
#  ja jätetään pois turha Tiedot-sarake

df.drop(columns='Tiedot', inplace=True)
df.head()

            2018
Alue 2019
Akaa       16611
Alajärvi    9700
Alavieska   2573
Alavus     11544
Asikkala    8149

In [39]:
# kunnat-dataframeen kunnat Akaasta Äänekoskelle

kunnat = df['Akaa':'Äänekoski']
kunnat.tail()

            2018
Alue 2019
Ylivieska  15212
Ylöjärvi   32983
Ypäjä       2357
Ähtäri      5703
Äänekoski  18851

In [40]:
# katsotaan uudelleen tilastot

kunnat.describe()

                2018
count     311.000000
mean    17742.504823
std     48795.634260
min        91.000000
25%      2722.500000
50%      6081.000000
75%     14638.000000
max    648042.000000

In [43]:
# katsotaan uudelleen isoimmat kunnat, lasketaan raja 100 000:een

kunnat[kunnat['2018'] > 100000]

             2018
Alue 2019
Espoo      283632
Helsinki   648042
Jyväskylä  141305
Kuopio     118664
Lahti      119951
Oulu       203567
Tampere    235239
Turku      191331
Vantaa     228166

In [100]:
# mitkä kunnat ovat lähellä keskiarvoa?

mean = kunnat['2018'].mean()


mean_mask = (kunnat['2018'] > mean - 1500) & (kunnat['2018'] < mean + 1500)

kunnat[mean_mask]

             2018
Alue 2019
Akaa        16611
Forssa      17028
Heinola     18889
Janakkala   16447
Kempele     17923
Laukaa      18927
Pieksämäki  17933
Äänekoski   18851

In [98]:
# alle 20 000 asukkaan kuntien määrä

pienten_maara = kunnat[kunnat['2018'] < 20000]['2018'].count()
pienten_maara

255

In [99]:
# alle 20 000 asukkaan kuntien osuus koko väestöstä

pienten_osuus = pienten_maara / kunnat['2018'].count()
pienten_osuus

0.819935691318328

In [65]:
# suurimmat 5 kuntaa

isot = kunnat.sort_values('2018', ascending=False).iloc[:5]
isot

             2018
Alue 2019
Helsinki   648042
Espoo      283632
Tampere    235239
Vantaa     228166
Oulu       203567

In [97]:
# 5 suurimman osuus koko väestöstä

isot['2018'].sum() / kunnat['2018'].sum()

0.28971900457400696

In [82]:
# montako pienimmistä kunnista mahtuisi suurimpaan (Helsinkiin)?
# Helsingin väkiluku

hel = kunnat['2018'].max()
hel

648042

In [95]:
laskuri = 1
summa = 0
kunnat_kokojarj = kunnat.sort_values('2018')

while summa <= hel:
    summa = kunnat_kokojarj['2018'].iloc[:laskuri].sum()
    
    laskuri += 1

print(f'summa, joka menee yli: {summa}')
print(f'laskuri: {laskuri}')

mahtuu = kunnat_kokojarj.iloc[:laskuri - 2] # pitää vähentää 2, koska yli menon jälkeen laskuriin on vielä lisätty 1
mahtuu

summa, joka menee yli: 655511
laskuri: 186

               2018
Alue 2019
Sottunga         91
Kökar           236
Kumlinge        315
Lumparland      382
Vårdö           448
...             ...
Kemijärvi      7370
Oulainen       7430
Uusikaarlepyy  7455
Nurmes         7641
Mynämäki       7766

[184 rows x 1 columns]

In [96]:
# tilastoja

mahtuu.describe()

              2018
count   184.000000
mean   3519.836957
std    1969.827560
min      91.000000
25%    2007.500000
50%    3113.500000
75%    4993.000000
max    7766.000000

In [93]:
# tarkistetaan vielä, että pikkukylien väestön summa on enintään sama kuin Helsingin 648042

mahtuu['2018'].sum()

647650